[
  {
    "type": "blog",
    "title": "Building Reecite: A Distraction-Free Quran & Hadith Reader",
    "summary": "I built Reecite, a minimalist Quran and Hadith reader designed to create a calm, focused space for daily spiritual engagement.",
    "content": "\n                    <p>By trade, I am a data professional. I spend my days dealing with logic, structure, and numbers. But I’ve always had a creative side that spreadsheets and SQL queries can't fully satisfy. I have a passion to&nbsp;<span data-path-to-node=\"3\" data-index-in-node=\"212\" style=\"\">build</span>&nbsp;and design things.&nbsp;<i><b data-path-to-node=\"4\" data-index-in-node=\"0\">Reecite</b> </i>is the project where I let that creative side take the wheel.</p><p><br></p><p>I built Reecite because I needed a break from the noise. I wanted to read the Quran and Hadiths without the clutter of complex apps fighting for my attention. I wanted a digital quiet corner, something that felt as calming as it looked.</p><p><br></p><p>Since I live in Python, <b data-path-to-node=\"6\" data-index-in-node=\"67\">FastAPI</b> was the natural choice for the backend. I skipped the heavy JavaScript frameworks and used <b data-path-to-node=\"6\" data-index-in-node=\"166\">HTMX</b> and <b data-path-to-node=\"6\" data-index-in-node=\"175\">Tailwind CSS</b> to keep things lightweight.</p><p><br></p><p data-path-to-node=\"7\">I initially tried to use <b data-path-to-node=\"7\" data-index-in-node=\"75\">DuckDB</b> for the database because, well, I love analytical tools. It felt clever. But when it came to production, I realized I needed stability over cleverness. So, I pivoted to <b data-path-to-node=\"8\" data-index-in-node=\"17\">Supabase</b>. It gave me a robust, managed PostgreSQL backend that handled the data effortlessly. It was a good lesson that sometimes the \"cool\" data tool isn't the right tool for a web app.</p><p data-path-to-node=\"7\"><br></p><p data-path-to-node=\"7\">I didn't just want it to work, I wanted it to <i data-path-to-node=\"9\" data-index-in-node=\"57\">feel</i> good. I obsessed over the UI, settling on a specific \"Matcha\" green palette (well, I love that color theme) to reduce eye strain. I added a simple streak tracker—not to gamify faith, but to encourage a small, consistent habit.</p><p data-path-to-node=\"7\"><br></p><p data-path-to-node=\"7\">Building Reecite reminded me that I don't have to choose between being a backend data engineer and a product builder. My data skills helped me structure the backend efficiently, but my love for design allowed me to create an experience that people might actually enjoy using.</p><p data-path-to-node=\"7\"><br></p><p data-path-to-node=\"7\">You can visit the live project here:&nbsp;<a href=\"reecite.vercel.app\">reecite.vercel.app</a></p><p data-path-to-node=\"7\"><br></p><p data-path-to-node=\"7\" style=\"text-align: center;\"><img src=\"images/reecite_home.png\" style=\"max-width: 100%; height: auto; margin-top: 10px; margin-bottom: 10px;\"></p>\n                ",
    "savedAt": "2026-02-18T12:38:34.152Z",
    "id": 1,
    "date": "2026-02-18"
  }
]