[
  {
    "type": "project",
    "title": "Automated Weather Pipeline for Dhaka",
    "summary": "Tried pulling data from an API. Stored the data as Parquet and then load and developed a Power BI dashboard.",
    "content": "<div style=\"text-align: justify;\">I wanted to move beyond static datasets from Kaggle and work with something \"live.\" I decided to build an automated pipeline that pulls real-time weather data for Dhaka using the Open-Meteo API. The raw data came in JSON format, which was quite extensive but needed structure to be useful. While fetching the data was straightforward using Python’s requests library, managing the storage efficiently proved to be a bit tricky. I didn't want to just dump everything into a CSV and create a mess. To streamline the process, I used Pandas to clean the data and filter for specific conditions (like temperatures above 20°C). Instead of standard CSVs, I decided to save the output as Parquet files. This optimized the storage significantly and preserved the data types, which saved me from having to re-cast columns later in Power BI.</div><div style=\"text-align: center;\"><img src=\"images/etl_notebook.png\" style=\"max-width: 100%; height: auto; margin-top: 10px; margin-bottom: 10px;\"></div><div style=\"text-align: justify;\">Now that I had optimized, structural data, I dived into visualization using Power BI. Since I used Parquet, the connection was seamless. I created a dynamic dashboard that doesn't just show a static history. Using relative date filtering and time-binning, I can now see specific hourly trends for \"Today\" alongside a 3-day forecast of maximum and minimum temperatures. It gives me an instant snapshot of the weather right now, without needing to manually refresh or clean a spreadsheet.</div><div style=\"text-align: center;\"><img src=\"images/etl_pbi.png\" style=\"max-width: 100%; height: auto; margin-top: 10px; margin-bottom: 10px;\"></div>",
    "savedAt": "2025-11-23T06:03:29.455Z",
    "id": 2,
    "date": "2025-11-23"
  },
  {
    "type": "project",
    "title": "Covid-19 Insights - My First Data Analytics Project",
    "summary": "This is my first data analytics project where I've used PowerBI for the first tiime",
    "content": "<div>I downloaded a COVID dataset from Kaggle, and it turned out to be quite extensive. Most columns were fine, but there were null values in some. I decided to clean it up by removing those null columns and started my analysis. While getting total cases and total deaths was straightforward using Power BI, calculating metrics like vaccinations per hundred people and death rates proved to be a bit tricky. The nature of the dataset was such that it provided daily updates, resulting in numerous duplicates. To streamline the data, I undertook manipulations to derive the total population and the number of people vaccinated for each country.</div><div style=\"text-align: center;\"><img src=\"images/covid-script.png\" style=\"max-width: 100%; height: auto; margin-top: 10px; margin-bottom: 10px;\"></div><div style=\"text-align: left;\"><div><br></div><div>After obtaining the data, I created a new sheet where I calculated the vaccination percentage of people for each country and later used it for visualization.</div><div style=\"text-align: center;\"><img src=\"images/popvac sheet.png\" style=\"max-width: 100%; height: auto; margin-top: 10px; margin-bottom: 10px;\"></div><div style=\"text-align: left;\"><br></div><div style=\"text-align: left;\">Next up, I needed to determine the death rate (how many people are dying per hundred cases) for each country. Using DAX, I created a new table specifically to calculate the death rate.</div><div style=\"text-align: center;\"><img src=\"images/death-ratio-dax.png\" style=\"max-width: 100%; height: auto; margin-top: 10px; margin-bottom: 10px;\"></div><div style=\"text-align: left;\"><br></div><div style=\"text-align: left;\">Now that I have all the metrics, I dived into visualization using Power BI and made a dynamic dashboard which shows all the key metrics regarding the pandemic.</div><div style=\"text-align: center;\"><img src=\"images/covid-dashboard.png\" style=\"max-width: 100%; height: auto; margin-top: 10px; margin-bottom: 10px;\"></div><div style=\"text-align: center;\"><br></div><div style=\"text-align: left;\">Now, if I want to view the data specific to my country, Bangladesh, I can use the country filter. Additionally, I have the flexibility to explore data for any particular year as needed.</div><div style=\"text-align: center;\"><img src=\"images/covid-bd.png\" style=\"max-width: 100%; height: auto; margin-top: 10px; margin-bottom: 10px;\"></div></div>",
    "savedAt": "2026-01-30T13:46:06.973Z",
    "id": 1,
    "date": "2024-01-09"
  }
]